#+title: notes/programming/lisp
<2022-01-09 Sun>
*** Local Named Functions
- To define a local function use the =flet= form
- =flet= is very similar to =let= for variables but instead
#+begin_src lisp
  (flet ((function_name (arguments)
	   ...function body))
    ...body)
#+end_src
- If you want to reference other local functions in an =flet= you should use =labels= instead
- You can also =labels= to call a local named function recursively
#+begin_src lisp
  (labels ((function_a (n)
	     (+ n 2))
	   (function_b (n)
	     (function_a (function_a n))))
    (function_b 2))
#+end_src

#+RESULTS:
: 6
*** push
- Adds item to the beginning of a list
- The list must be a variable
#+begin_src lisp
  (defparameter *some-list* nil)

  (push 4 *some-list*)
  (push 3 *some-list*)
  (push 2 *some-list*)
  (push 1 *some-list*)
  ,*some-list*
#+end_src

#+RESULTS:
| 1 | 2 | 3 | 4 |

** Association Lists (alists)
- Use =assoc= to find the value of a key in an alist
#+begin_src lisp
  (assoc 'mykey '((somekey (some-value))
		  (mykey (my-value))
		  (otherkey (other-value))))
#+end_src

#+RESULTS:
| MYKEY | (MY-VALUE) |
- alists can have multiple instances of a key inside them
- When this happens =assoc= will return the first instance
- If you push new keys into the alist you can overwrite the value of a key while preserving the previous value
